{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[SOS]": 0,
      "[EOS]": 1,
      "[UNK]": 2,
      "[MASK]": 3,
      "[PAD]": 4,
      "a": 5,
      "b": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "j": 14,
      "k": 15,
      "l": 16,
      "m": 17,
      "n": 18,
      "o": 19,
      "p": 20,
      "q": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "w": 27,
      "x": 28,
      "y": 29,
      "z": 30,
      "ª": 31,
      "ß": 32,
      "à": 33,
      "á": 34,
      "â": 35,
      "ã": 36,
      "ä": 37,
      "ç": 38,
      "è": 39,
      "é": 40,
      "ê": 41,
      "ë": 42,
      "ì": 43,
      "í": 44,
      "î": 45,
      "ï": 46,
      "ð": 47,
      "ñ": 48,
      "ò": 49,
      "ó": 50,
      "ô": 51,
      "ö": 52,
      "ø": 53,
      "ù": 54,
      "ú": 55,
      "ü": 56,
      "ć": 57,
      "ň": 58,
      "ő": 59,
      "š": 60,
      "ž": 61,
      "ư": 62,
      "μ": 63,
      "а": 64,
      "б": 65,
      "в": 66,
      "г": 67,
      "д": 68,
      "е": 69,
      "ж": 70,
      "з": 71,
      "и": 72,
      "й": 73,
      "к": 74,
      "л": 75,
      "м": 76,
      "н": 77,
      "о": 78,
      "п": 79,
      "р": 80,
      "с": 81,
      "т": 82,
      "у": 83,
      "ф": 84,
      "х": 85,
      "ц": 86,
      "ч": 87,
      "ш": 88,
      "щ": 89,
      "ъ": 90,
      "ы": 91,
      "ь": 92,
      "э": 93,
      "ю": 94,
      "я": 95,
      "ё": 96,
      "є": 97,
      "і": 98,
      "ї": 99,
      "ớ": 100,
      "ст": 101,
      "ен": 102,
      "то": 103,
      "но": 104,
      "на": 105,
      "ра": 106,
      "по": 107,
      "ро": 108,
      "ко": 109,
      "ре": 110,
      "ни": 111,
      "ет": 112,
      "го": 113,
      "ли": 114,
      "ва": 115,
      "во": 116,
      "ка": 117,
      "не": 118,
      "ль": 119,
      "ны": 120,
      "те": 121,
      "ри": 122,
      "за": 123,
      "ла": 124,
      "ть": 125,
      "та": 126,
      "ло": 127,
      "да": 128,
      "об": 129,
      "ени": 130,
      "ки": 131,
      "де": 132,
      "ле": 133,
      "мо": 134,
      "ся": 135,
      "до": 136,
      "ти": 137,
      "про": 138,
      "ми": 139,
      "ви": 140,
      "ве": 141,
      "со": 142,
      "ма": 143,
      "это": 144,
      "се": 145,
      "вы": 146,
      "ме": 147,
      "ди": 148,
      "ци": 149,
      "ру": 150,
      "бо": 151,
      "че": 152,
      "ля": 153,
      "пе": 154,
      "ста": 155,
      "си": 156,
      "бы": 157,
      "при": 158,
      "что": 159,
      "от": 160,
      "ча": 161,
      "пре": 162,
      "из": 163,
      "па": 164,
      "ры": 165,
      "са": 166,
      "же": 167,
      "сто": 168,
      "ско": 169,
      "чи": 170,
      "хо": 171,
      "сти": 172,
      "ку": 173,
      "ду": 174,
      "га": 175,
      "му": 176,
      "мы": 177,
      "ги": 178,
      "раз": 179,
      "мен": 180,
      "ну": 181,
      "ения": 182,
      "сь": 183,
      "ение": 184,
      "ши": 185,
      "лу": 186,
      "тель": 187,
      "ски": 188,
      "бе": 189,
      "ной": 190,
      "бу": 191,
      "ют": 192,
      "ные": 193,
      "ше": 194,
      "ется": 195,
      "жи": 196,
      "су": 197,
      "ных": 198,
      "сть": 199,
      "он": 200,
      "ще": 201,
      "ного": 202,
      "ту": 203,
      "под": 204,
      "сле": 205,
      "ин": 206,
      "ты": 207,
      "ств": 208,
      "пи": 209,
      "все": 210,
      "ный": 211,
      "лю": 212,
      "щи": 213,
      "пра": 214,
      "для": 215,
      "ня": 216,
      "ции": 217,
      "вер": 218,
      "кото": 219,
      "жа": 220,
      "как": 221,
      "ска": 222,
      "дет": 223,
      "ба": 224,
      "пред": 225,
      "зи": 226,
      "кон": 227,
      "пу": 228,
      "стра": 229,
      "лен": 230,
      "сво": 231,
      "ор": 232,
      "ком": 233,
      "спо": 234,
      "вать": 235,
      "ние": 236,
      "це": 237,
      "так": 238,
      "гра": 239,
      "мож": 240,
      "ден": 241,
      "ство": 242,
      "сси": 243,
      "фи": 244,
      "пере": 245,
      "ды": 246,
      "пер": 247,
      "ния": 248,
      "ря": 249
    },
    "merges": [
      "с т",
      "е н",
      "т о",
      "н о",
      "н а",
      "р а",
      "п о",
      "р о",
      "к о",
      "р е",
      "н и",
      "е т",
      "г о",
      "л и",
      "в а",
      "в о",
      "к а",
      "н е",
      "л ь",
      "н ы",
      "т е",
      "р и",
      "з а",
      "л а",
      "т ь",
      "т а",
      "л о",
      "д а",
      "о б",
      "ен и",
      "к и",
      "д е",
      "л е",
      "м о",
      "с я",
      "д о",
      "т и",
      "п ро",
      "м и",
      "в и",
      "в е",
      "с о",
      "м а",
      "э то",
      "с е",
      "в ы",
      "м е",
      "д и",
      "ц и",
      "р у",
      "б о",
      "ч е",
      "л я",
      "п е",
      "ст а",
      "с и",
      "б ы",
      "п ри",
      "ч то",
      "о т",
      "ч а",
      "п ре",
      "и з",
      "п а",
      "р ы",
      "с а",
      "ж е",
      "ст о",
      "с ко",
      "ч и",
      "х о",
      "ст и",
      "к у",
      "д у",
      "г а",
      "м у",
      "м ы",
      "г и",
      "ра з",
      "м ен",
      "н у",
      "ени я",
      "с ь",
      "ени е",
      "ш и",
      "л у",
      "те ль",
      "с ки",
      "б е",
      "но й",
      "б у",
      "ю т",
      "ны е",
      "ш е",
      "ет ся",
      "ж и",
      "с у",
      "ны х",
      "ст ь",
      "о н",
      "щ е",
      "но го",
      "т у",
      "по д",
      "с ле",
      "и н",
      "т ы",
      "ст в",
      "п и",
      "в се",
      "ны й",
      "л ю",
      "щ и",
      "п ра",
      "д ля",
      "н я",
      "ци и",
      "ве р",
      "ко то",
      "ж а",
      "ка к",
      "с ка",
      "д ет",
      "б а",
      "пре д",
      "з и",
      "ко н",
      "п у",
      "ст ра",
      "л ен",
      "с во",
      "о р",
      "ко м",
      "с по",
      "ва ть",
      "ни е",
      "ц е",
      "та к",
      "г ра",
      "мо ж",
      "д ен",
      "ст во",
      "с си",
      "ф и",
      "пе ре",
      "д ы",
      "пе р",
      "ни я",
      "р я"
    ]
  }
}