{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[SOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[SOS]": {
        "id": "[SOS]",
        "ids": [
          0
        ],
        "tokens": [
          "[SOS]"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "[EOF]"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "[EOF]",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[SOS]": 0,
      "[EOS]": 1,
      "[UNK]": 2,
      "[MASK]": 3,
      "[PAD]": 4,
      "a": 5,
      "b": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "j": 14,
      "k": 15,
      "l": 16,
      "m": 17,
      "n": 18,
      "o": 19,
      "p": 20,
      "q": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "w": 27,
      "x": 28,
      "y": 29,
      "z": 30,
      "ª": 31,
      "ß": 32,
      "à": 33,
      "á": 34,
      "â": 35,
      "ã": 36,
      "ä": 37,
      "ç": 38,
      "è": 39,
      "é": 40,
      "ê": 41,
      "ë": 42,
      "ì": 43,
      "í": 44,
      "î": 45,
      "ï": 46,
      "ð": 47,
      "ñ": 48,
      "ò": 49,
      "ó": 50,
      "ô": 51,
      "ö": 52,
      "ø": 53,
      "ù": 54,
      "ú": 55,
      "ü": 56,
      "ć": 57,
      "ň": 58,
      "ő": 59,
      "š": 60,
      "ž": 61,
      "ư": 62,
      "μ": 63,
      "а": 64,
      "б": 65,
      "в": 66,
      "г": 67,
      "д": 68,
      "е": 69,
      "ж": 70,
      "з": 71,
      "и": 72,
      "й": 73,
      "к": 74,
      "л": 75,
      "м": 76,
      "н": 77,
      "о": 78,
      "п": 79,
      "р": 80,
      "с": 81,
      "т": 82,
      "у": 83,
      "ф": 84,
      "х": 85,
      "ц": 86,
      "ч": 87,
      "ш": 88,
      "щ": 89,
      "ъ": 90,
      "ы": 91,
      "ь": 92,
      "э": 93,
      "ю": 94,
      "я": 95,
      "ё": 96,
      "є": 97,
      "і": 98,
      "ї": 99,
      "ớ": 100,
      "й[EOF]": 101,
      "я[EOF]": 102,
      "в[EOF]": 103,
      "у[EOF]": 104,
      "l[EOF]": 105,
      "ь[EOF]": 106,
      "л[EOF]": 107,
      "а[EOF]": 108,
      "ю[EOF]": 109,
      "и[EOF]": 110,
      "м[EOF]": 111,
      "с[EOF]": 112,
      "е[EOF]": 113,
      "х[EOF]": 114,
      "о[EOF]": 115,
      "р[EOF]": 116,
      "т[EOF]": 117,
      "н[EOF]": 118,
      "з[EOF]": 119,
      "ц[EOF]": 120,
      "s[EOF]": 121,
      "ы[EOF]": 122,
      "y[EOF]": 123,
      "a[EOF]": 124,
      "c[EOF]": 125,
      "n[EOF]": 126,
      "г[EOF]": 127,
      "t[EOF]": 128,
      "r[EOF]": 129,
      "e[EOF]": 130,
      "к[EOF]": 131,
      "ж[EOF]": 132,
      "o[EOF]": 133,
      "д[EOF]": 134,
      "b[EOF]": 135,
      "h[EOF]": 136,
      "э[EOF]": 137,
      "i[EOF]": 138,
      "u[EOF]": 139,
      "j[EOF]": 140,
      "d[EOF]": 141,
      "п[EOF]": 142,
      "k[EOF]": 143,
      "ф[EOF]": 144,
      "x[EOF]": 145,
      "g[EOF]": 146,
      "ё[EOF]": 147,
      "v[EOF]": 148,
      "ч[EOF]": 149,
      "m[EOF]": 150,
      "w[EOF]": 151,
      "q[EOF]": 152,
      "б[EOF]": 153,
      "z[EOF]": 154,
      "ш[EOF]": 155,
      "p[EOF]": 156,
      "é[EOF]": 157,
      "f[EOF]": 158,
      "щ[EOF]": 159,
      "ó[EOF]": 160,
      "á[EOF]": 161,
      "à[EOF]": 162,
      "і[EOF]": 163,
      "ъ[EOF]": 164,
      "є[EOF]": 165,
      "ª[EOF]": 166,
      "ï[EOF]": 167,
      "ê[EOF]": 168,
      "ä[EOF]": 169,
      "ú[EOF]": 170,
      "ć[EOF]": 171,
      "ї[EOF]": 172,
      "ň[EOF]": 173,
      "î[EOF]": 174,
      "è[EOF]": 175,
      "ст": 176,
      "ен": 177,
      "ро": 178,
      "ра": 179,
      "по": 180,
      "ко": 181,
      "ре": 182,
      "но": 183,
      "то": 184,
      "на": 185,
      "ни": 186,
      "во": 187,
      "ва": 188,
      "ль": 189,
      "ка": 190,
      "те": 191,
      "ри": 192,
      "ны": 193,
      "де": 194,
      "то[EOF]": 195,
      "за": 196,
      "ли": 197,
      "ть[EOF]": 198,
      "го[EOF]": 199,
      "об": 200,
      "ени": 201,
      "на[EOF]": 202,
      "не": 203,
      "та": 204,
      "ве": 205,
      "мо": 206,
      "ле": 207,
      "ло": 208,
      "про": 209,
      "ся[EOF]": 210,
      "ви": 211,
      "ла": 212,
      "ти": 213,
      "до": 214,
      "но[EOF]": 215,
      "да": 216,
      "со": 217,
      "го": 218,
      "ме": 219,
      "че": 220,
      "ли[EOF]": 221,
      "ци": 222,
      "не[EOF]": 223,
      "ди": 224,
      "ру": 225,
      "бо": 226,
      "пе": 227,
      "ма": 228,
      "се": 229,
      "вы": 230,
      "ки": 231,
      "си": 232,
      "ста": 233,
      "ет[EOF]": 234,
      "ств": 235,
      "пре": 236,
      "тся[EOF]": 237,
      "ча": 238,
      "при": 239,
      "хо": 240,
      "па": 241,
      "ми": 242,
      "ско": 243,
      "что[EOF]": 244,
      "от": 245,
      "чи": 246,
      "это[EOF]": 247,
      "ки[EOF]": 248,
      "ми[EOF]": 249
    },
    "merges": [
      "с т",
      "е н",
      "р о",
      "р а",
      "п о",
      "к о",
      "р е",
      "н о",
      "т о",
      "н а",
      "н и",
      "в о",
      "в а",
      "л ь",
      "к а",
      "т е",
      "р и",
      "н ы",
      "д е",
      "т о[EOF]",
      "з а",
      "л и",
      "т ь[EOF]",
      "г о[EOF]",
      "о б",
      "ен и",
      "н а[EOF]",
      "н е",
      "т а",
      "в е",
      "м о",
      "л е",
      "л о",
      "п ро",
      "с я[EOF]",
      "в и",
      "л а",
      "т и",
      "д о",
      "н о[EOF]",
      "д а",
      "с о",
      "г о",
      "м е",
      "ч е",
      "л и[EOF]",
      "ц и",
      "н е[EOF]",
      "д и",
      "р у",
      "б о",
      "п е",
      "м а",
      "с е",
      "в ы",
      "к и",
      "с и",
      "ст а",
      "е т[EOF]",
      "ст в",
      "п ре",
      "т ся[EOF]",
      "ч а",
      "п ри",
      "х о",
      "п а",
      "м и",
      "с ко",
      "ч то[EOF]",
      "о т",
      "ч и",
      "э то[EOF]",
      "к и[EOF]",
      "м и[EOF]"
    ]
  }
}